Masmiseim36/nxpSDK/devices/MIMXRT1182/mcuxpresso/startup_mimxrt1182.c
WEAK void LPUART1_IRQHandler(void)
{   LPUART1_DriverIRQHandler();
}

WEAK void LPUART2_IRQHandler(void)
{   LPUART2_DriverIRQHandler();
}

WEAK void MU1_IRQHandler(void)
{   MU1_DriverIRQHandler();
}

WEAK void MU2_IRQHandler(void)
{   MU2_DriverIRQHandler();
}

WEAK void PWM1_FAULT_IRQHandler(void)
{   PWM1_FAULT_DriverIRQHandler();
}

WEAK void PWM1_0_IRQHandler(void)
{   PWM1_0_DriverIRQHandler();
}

WEAK void PWM1_1_IRQHandler(void)
{   PWM1_1_DriverIRQHandler();
}

WEAK void PWM1_2_IRQHandler(void)
{   PWM1_2_DriverIRQHandler();
}

WEAK void PWM1_3_IRQHandler(void)
{   PWM1_3_DriverIRQHandler();
}

WEAK void EDGELOCK_TRUST_MUA_RX_FULL_IRQHandler(void)
{   EDGELOCK_TRUST_MUA_RX_FULL_DriverIRQHandler();
}

WEAK void EDGELOCK_TRUST_MUA_TX_EMPTY_IRQHandler(void)
{   EDGELOCK_TRUST_MUA_TX_EMPTY_DriverIRQHandler();
}

WEAK void EDGELOCK_APPS_CORE_MUA_RX_FULL_IRQHandler(void)
{   EDGELOCK_APPS_CORE_MUA_RX_FULL_DriverIRQHandler();
}

WEAK void EDGELOCK_APPS_CORE_MUA_TX_EMPTY_IRQHandler(void)
{   EDGELOCK_APPS_CORE_MUA_TX_EMPTY_DriverIRQHandler();
}

WEAK void EDGELOCK_REALTIME_CORE_MUA_RX_FULL_IRQHandler(void)
{   EDGELOCK_REALTIME_CORE_MUA_RX_FULL_DriverIRQHandler();
}

WEAK void EDGELOCK_REALTIME_CORE_MUA_TX_EMPTY_IRQHandler(void)
{   EDGELOCK_REALTIME_CORE_MUA_TX_EMPTY_DriverIRQHandler();
}

WEAK void EDGELOCK_SECURE_IRQHandler(void)
{   EDGELOCK_SECURE_DriverIRQHandler();
}

WEAK void EDGELOCK_NONSECURE_IRQHandler(void)
{   EDGELOCK_NONSECURE_DriverIRQHandler();
}

WEAK void TPM1_IRQHandler(void)
{   TPM1_DriverIRQHandler();
}

WEAK void TPM2_IRQHandler(void)
{   TPM2_DriverIRQHandler();
}

WEAK void RTWDOG1_IRQHandler(void)
{   RTWDOG1_DriverIRQHandler();
}

WEAK void RTWDOG2_IRQHandler(void)
{   RTWDOG2_DriverIRQHandler();
}

WEAK void TRDC_MGR_AON_IRQHandler(void)
{   TRDC_MGR_AON_DriverIRQHandler();
}

WEAK void PDM_HWVAD_EVENT_IRQHandler(void)
{   PDM_HWVAD_EVENT_DriverIRQHandler();
}

WEAK void PDM_HWVAD_ERROR_IRQHandler(void)
{   PDM_HWVAD_ERROR_DriverIRQHandler();
}

WEAK void PDM_EVENT_IRQHandler(void)
{   PDM_EVENT_DriverIRQHandler();
}

WEAK void PDM_ERROR_IRQHandler(void)
{   PDM_ERROR_DriverIRQHandler();
}

WEAK void SAI1_IRQHandler(void)
{   SAI1_DriverIRQHandler();
}

WEAK void CM33_PS_IRQHandler(void)
{   CM33_PS_DriverIRQHandler();
}

WEAK void CM33_TCM_ECC_IRQHandler(void)
{   CM33_TCM_ECC_DriverIRQHandler();
}

WEAK void CM33_TCM_ERROR_IRQHandler(void)
{   CM33_TCM_ERROR_DriverIRQHandler();
}

WEAK void CM7_TCM_ECC_IRQHandler(void)
{   CM7_TCM_ECC_DriverIRQHandler();
}

WEAK void CM7_TCM_ERROR_IRQHandler(void)
{   CM7_TCM_ERROR_DriverIRQHandler();
}

WEAK void CAN2_IRQHandler(void)
{   CAN2_DriverIRQHandler();
}

WEAK void CAN2_ERROR_IRQHandler(void)
{   CAN2_ERROR_DriverIRQHandler();
}

WEAK void FLEXIO1_IRQHandler(void)
{   FLEXIO1_DriverIRQHandler();
}

WEAK void FLEXIO2_IRQHandler(void)
{   FLEXIO2_DriverIRQHandler();
}

WEAK void FLEXSPI1_IRQHandler(void)
{   FLEXSPI1_DriverIRQHandler();
}

WEAK void FLEXSPI2_IRQHandler(void)
{   FLEXSPI2_DriverIRQHandler();
}

WEAK void GPIO2_0_IRQHandler(void)
{   GPIO2_0_DriverIRQHandler();
}

WEAK void GPIO2_1_IRQHandler(void)
{   GPIO2_1_DriverIRQHandler();
}

WEAK void GPIO3_0_IRQHandler(void)
{   GPIO3_0_DriverIRQHandler();
}

WEAK void GPIO3_1_IRQHandler(void)
{   GPIO3_1_DriverIRQHandler();
}

WEAK void I3C2_IRQHandler(void)
{   I3C2_DriverIRQHandler();
}

WEAK void LPI2C3_IRQHandler(void)
{   LPI2C3_DriverIRQHandler();
}

WEAK void Reserved79_IRQHandler(void)
{   Reserved79_DriverIRQHandler();
}

WEAK void LPIT2_IRQHandler(void)
{   LPIT2_DriverIRQHandler();
}

WEAK void LPSPI3_IRQHandler(void)
{   LPSPI3_DriverIRQHandler();
}

WEAK void LPSPI4_IRQHandler(void)
{   LPSPI4_DriverIRQHandler();
}

WEAK void Reserved83_IRQHandler(void)
{   Reserved83_DriverIRQHandler();
}

WEAK void LPUART3_IRQHandler(void)
{   LPUART3_DriverIRQHandler();
}

WEAK void LPUART4_IRQHandler(void)
{   LPUART4_DriverIRQHandler();
}

WEAK void LPUART5_IRQHandler(void)
{   LPUART5_DriverIRQHandler();
}

WEAK void LPUART6_IRQHandler(void)
{   LPUART6_DriverIRQHandler();
}

WEAK void Reserved88_IRQHandler(void)
{   Reserved88_DriverIRQHandler();
}

WEAK void BBNSM_IRQHandler(void)
{   BBNSM_DriverIRQHandler();
}

WEAK void SYS_CTR1_IRQHandler(void)
{   SYS_CTR1_DriverIRQHandler();
}

WEAK void TPM3_IRQHandler(void)
{   TPM3_DriverIRQHandler();
}

WEAK void Reserved92_IRQHandler(void)
{   Reserved92_DriverIRQHandler();
}

WEAK void Reserved93_IRQHandler(void)
{   Reserved93_DriverIRQHandler();
}

WEAK void Reserved94_IRQHandler(void)
{   Reserved94_DriverIRQHandler();
}

WEAK void RTWDOG3_IRQHandler(void)
{   RTWDOG3_DriverIRQHandler();
}

WEAK void RTWDOG4_IRQHandler(void)
{   RTWDOG4_DriverIRQHandler();
}

WEAK void RTWDOG5_IRQHandler(void)
{   RTWDOG5_DriverIRQHandler();
}

WEAK void TRDC_MGR_WKUP_IRQHandler(void)
{   TRDC_MGR_WKUP_DriverIRQHandler();
}

WEAK void TMPSNS_INT_IRQHandler(void)
{   TMPSNS_INT_DriverIRQHandler();
}

WEAK void BBSM_IRQHandler(void)
{   BBSM_DriverIRQHandler();
}

WEAK void LDO_AON_ANA_IRQHandler(void)
{   LDO_AON_ANA_DriverIRQHandler();
}

WEAK void USDHC1_IRQHandler(void)
{   USDHC1_DriverIRQHandler();
}

WEAK void Reserved103_IRQHandler(void)
{   Reserved103_DriverIRQHandler();
}

WEAK void TRDC_MGR_MEGA_IRQHandler(void)
{   TRDC_MGR_MEGA_DriverIRQHandler();
}

WEAK void SFA_IRQHandler(void)
{   SFA_DriverIRQHandler();
}

WEAK void LDO_AON_DIG_IRQHandler(void)
{   LDO_AON_DIG_DriverIRQHandler();
}

WEAK void MECC1_IRQHandler(void)
{   MECC1_DriverIRQHandler();
}

WEAK void MECC2_IRQHandler(void)
{   MECC2_DriverIRQHandler();
}

WEAK void ADC1_IRQHandler(void)
{   ADC1_DriverIRQHandler();
}

WEAK void DMA_ERROR_IRQHandler(void)
{   DMA_ERROR_DriverIRQHandler();
}

WEAK void DMA3_CH0_IRQHandler(void)
{   DMA3_CH0_DriverIRQHandler();
}

WEAK void DMA3_CH1_IRQHandler(void)
{   DMA3_CH1_DriverIRQHandler();
}

WEAK void DMA3_CH2_IRQHandler(void)
{   DMA3_CH2_DriverIRQHandler();
}

WEAK void DMA3_CH3_IRQHandler(void)
{   DMA3_CH3_DriverIRQHandler();
}

WEAK void DMA3_CH4_IRQHandler(void)
{   DMA3_CH4_DriverIRQHandler();
}

WEAK void DMA3_CH5_IRQHandler(void)
{   DMA3_CH5_DriverIRQHandler();
}

